luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_reg.h
/** \brief  FC04, CPU Clock Cycle Count */
#define CPU2_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF885FC04u)

/** \brief  FC00, Counter Control */
#define CPU2_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF885FC00u)

/** \brief  9400, Compatibility Control Register */
#define CPU2_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8859400u)

/** \brief  FE1C, CPU Core Identification Register */
#define CPU2_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF885FE1Cu)

/** \brief  D000, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D000u)

/** \brief  D004, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D004u)

/** \brief  D008, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D008u)

/** \brief  D00C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D00Cu)

/** \brief  D010, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D010u)

/** \brief  D014, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D014u)

/** \brief  D018, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D018u)

/** \brief  D01C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D01Cu)

/** \brief  D020, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D020u)

/** \brief  D024, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D024u)

/** \brief  D028, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D028u)

/** \brief  D02C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D02Cu)

/** \brief  D030, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D030u)

/** \brief  D034, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D034u)

/** \brief  D038, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D038u)

/** \brief  D03C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D03Cu)

/** \brief  FE18, CPU Identification Register TC1.6P */
#define CPU2_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF885FE18u)

/** \brief  E000, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E000u)

/** Alias (User Manual Name) for CPU2_CPXE0.
* To use register names with standard convension, please use CPU2_CPXE0.
*/
#define	CPU2_CPXE_0	(CPU2_CPXE0)

/** \brief  E004, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E004u)

/** Alias (User Manual Name) for CPU2_CPXE1.
* To use register names with standard convension, please use CPU2_CPXE1.
*/
#define	CPU2_CPXE_1	(CPU2_CPXE1)

/** \brief  E008, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E008u)

/** Alias (User Manual Name) for CPU2_CPXE2.
* To use register names with standard convension, please use CPU2_CPXE2.
*/
#define	CPU2_CPXE_2	(CPU2_CPXE2)

/** \brief  E00C, CPU Code Protection Execute Enable Register Set */
#define CPU2_CPXE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E00Cu)

/** Alias (User Manual Name) for CPU2_CPXE3.
* To use register names with standard convension, please use CPU2_CPXE3.
*/
#define	CPU2_CPXE_3	(CPU2_CPXE3)

/** \brief  FD0C, Core Register Access Event */
#define CPU2_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF885FD0Cu)

/** \brief  FE50, CPU Customer ID register */
#define CPU2_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF885FE50u)

/** \brief  FF00, Data General Purpose Register */
#define CPU2_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF00u)

/** \brief  FF04, Data General Purpose Register */
#define CPU2_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF04u)

/** \brief  FF28, Data General Purpose Register */
#define CPU2_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF28u)

/** \brief  FF2C, Data General Purpose Register */
#define CPU2_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF2Cu)

/** \brief  FF30, Data General Purpose Register */
#define CPU2_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF30u)

/** \brief  FF34, Data General Purpose Register */
#define CPU2_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF34u)

/** \brief  FF38, Data General Purpose Register */
#define CPU2_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF38u)

/** \brief  FF3C, Data General Purpose Register */
#define CPU2_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF3Cu)

/** \brief  FF08, Data General Purpose Register */
#define CPU2_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF08u)

/** \brief  FF0C, Data General Purpose Register */
#define CPU2_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF0Cu)

/** \brief  FF10, Data General Purpose Register */
#define CPU2_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF10u)

/** \brief  FF14, Data General Purpose Register */
#define CPU2_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF14u)

/** \brief  FF18, Data General Purpose Register */
#define CPU2_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF18u)

