luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_reg.h
/** \brief  FF1C, Data General Purpose Register */
#define CPU2_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF1Cu)

/** \brief  FF20, Data General Purpose Register */
#define CPU2_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF20u)

/** \brief  FF24, Data General Purpose Register */
#define CPU2_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF885FF24u)

/** \brief  9018, Data Asynchronous Trap Register */
#define CPU2_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8859018u)

/** \brief  FD00, Debug Status Register */
#define CPU2_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF885FD00u)

/** \brief  FD48, Debug Trap Control Register */
#define CPU2_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF885FD48u)

/** \brief  9040, Data Memory Control Register */
#define CPU2_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8859040u)

/** \brief  9000, Data Control Register 2 */
#define CPU2_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8859000u)

/** \brief  FD44, CPU Debug Context Save Area Pointer */
#define CPU2_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF885FD44u)

/** \brief  901C, Data Error Address Register */
#define CPU2_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF885901Cu)

/** \brief  9020, Data Integrity Error Address Register */
#define CPU2_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8859020u)

/** \brief  9024, Data Integrity Error Trap Register */
#define CPU2_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8859024u)

/** \brief  FD40, CPU Debug Monitor Start Address */
#define CPU2_DMS /*lint --e(923)*/ (*(volatile Ifx_CPU_DMS*)0xF885FD40u)

/** \brief  C000, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C000u)

/** \brief  C004, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C004u)

/** \brief  C050, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR10_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C050u)

/** \brief  C054, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR10_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C054u)

/** \brief  C058, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR11_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C058u)

/** \brief  C05C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR11_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C05Cu)

/** \brief  C060, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR12_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C060u)

/** \brief  C064, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR12_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C064u)

/** \brief  C068, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR13_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C068u)

/** \brief  C06C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR13_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C06Cu)

/** \brief  C070, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR14_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C070u)

/** \brief  C074, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR14_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C074u)

/** \brief  C078, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR15_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C078u)

/** \brief  C07C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR15_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C07Cu)

/** \brief  C008, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C008u)

/** \brief  C00C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C00Cu)

/** \brief  C010, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C010u)

/** \brief  C014, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C014u)

/** \brief  C018, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C018u)

/** \brief  C01C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C01Cu)

/** \brief  C020, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C020u)

/** \brief  C024, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C024u)

/** \brief  C028, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C028u)

/** \brief  C02C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C02Cu)

/** \brief  C030, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C030u)

/** \brief  C034, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C034u)

/** \brief  C038, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C038u)

/** \brief  C03C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C03Cu)

/** \brief  C040, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR8_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C040u)

/** \brief  C044, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR8_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C044u)

