luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_reg.h
/** \brief  C048, CPU Data Protection Range, Lower Bound Register */
#define CPU2_DPR9_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C048u)

/** \brief  C04C, CPU Data Protection Range, Upper Bound Register */
#define CPU2_DPR9_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C04Cu)

/** \brief  E010, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E010u)

/** Alias (User Manual Name) for CPU2_DPRE0.
* To use register names with standard convension, please use CPU2_DPRE0.
*/
#define	CPU2_DPRE_0	(CPU2_DPRE0)

/** \brief  E014, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E014u)

/** Alias (User Manual Name) for CPU2_DPRE1.
* To use register names with standard convension, please use CPU2_DPRE1.
*/
#define	CPU2_DPRE_1	(CPU2_DPRE1)

/** \brief  E018, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E018u)

/** Alias (User Manual Name) for CPU2_DPRE2.
* To use register names with standard convension, please use CPU2_DPRE2.
*/
#define	CPU2_DPRE_2	(CPU2_DPRE2)

/** \brief  E01C, CPU Data Protection Read Enable Register Set */
#define CPU2_DPRE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPRE*)0xF885E01Cu)

/** Alias (User Manual Name) for CPU2_DPRE3.
* To use register names with standard convension, please use CPU2_DPRE3.
*/
#define	CPU2_DPRE_3	(CPU2_DPRE3)

/** \brief  E020, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E020u)

/** Alias (User Manual Name) for CPU2_DPWE0.
* To use register names with standard convension, please use CPU2_DPWE0.
*/
#define	CPU2_DPWE_0	(CPU2_DPWE0)

/** \brief  E024, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E024u)

/** Alias (User Manual Name) for CPU2_DPWE1.
* To use register names with standard convension, please use CPU2_DPWE1.
*/
#define	CPU2_DPWE_1	(CPU2_DPWE1)

/** \brief  E028, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E028u)

/** Alias (User Manual Name) for CPU2_DPWE2.
* To use register names with standard convension, please use CPU2_DPWE2.
*/
#define	CPU2_DPWE_2	(CPU2_DPWE2)

/** \brief  E02C, CPU Data Protection Write Enable Register Set */
#define CPU2_DPWE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_DPWE*)0xF885E02Cu)

/** Alias (User Manual Name) for CPU2_DPWE3.
* To use register names with standard convension, please use CPU2_DPWE3.
*/
#define	CPU2_DPWE_3	(CPU2_DPWE3)

/** \brief  9010, Data Synchronous Trap Register */
#define CPU2_DSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_DSTR*)0xF8859010u)

/** \brief  FD08, External Event Register */
#define CPU2_EXEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_EXEVT*)0xF885FD08u)

/** \brief  FE38, Free CSA List Head Pointer */
#define CPU2_FCX /*lint --e(923)*/ (*(volatile Ifx_CPU_FCX*)0xF885FE38u)

/** \brief  A000, CPU Trap Control Register */
#define CPU2_FPU_TRAP_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_CON*)0xF885A000u)

/** \brief  A008, CPU Trapping Instruction Opcode Register */
#define CPU2_FPU_TRAP_OPC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_OPC*)0xF885A008u)

/** \brief  A004, CPU Trapping Instruction Program Counter Register */
#define CPU2_FPU_TRAP_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_PC*)0xF885A004u)

/** \brief  A010, CPU Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC1 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC1*)0xF885A010u)

/** \brief  A014, CPU Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF885A014u)

/** \brief  A018, Trapping Instruction Operand Register */
#define CPU2_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF885A018u)

/** \brief  FC08, Instruction Count */
#define CPU2_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF885FC08u)

/** \brief  FE2C, Interrupt Control Register */
#define CPU2_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF885FE2Cu)

/** \brief  FE28, Interrupt Stack Pointer */
#define CPU2_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF885FE28u)

/** \brief  FE3C, Free CSA List Limit Pointer */
#define CPU2_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF885FE3Cu)

/** \brief  FC0C, Multi-Count Register 1 */
#define CPU2_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF885FC0Cu)

/** \brief  FC10, Multi-Count Register 2 */
#define CPU2_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF885FC10u)

/** \brief  FC14, Multi-Count Register 3 */
#define CPU2_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF885FC14u)

/** \brief  FE08, Program Counter */
#define CPU2_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_PC*)0xF885FE08u)

/** \brief  920C, Program Control 0 */
#define CPU2_PCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON0*)0xF885920Cu)

/** \brief  9204, Program Control 1 */
#define CPU2_PCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON1*)0xF8859204u)

/** \brief  9208, Program Control 2 */
#define CPU2_PCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON2*)0xF8859208u)

/** \brief  FE00, Previous Context Information Register */
#define CPU2_PCXI /*lint --e(923)*/ (*(volatile Ifx_CPU_PCXI*)0xF885FE00u)

/** \brief  9210, Program Integrity Error Address Register */
#define CPU2_PIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8859210u)

/** \brief  9214, Program Integrity Error Trap Register */
#define CPU2_PIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIETR*)0xF8859214u)

/** \brief  8100, Data Access CacheabilityRegister */
#define CPU2_PMA0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA0*)0xF8858100u)

/** \brief  8104, Code Access CacheabilityRegister */
#define CPU2_PMA1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA1*)0xF8858104u)

/** \brief  8108, Peripheral Space Identifier register */
#define CPU2_PMA2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA2*)0xF8858108u)

