luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_reg.h
/** \brief  9200, Program Synchronous Trap Register */
#define CPU2_PSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_PSTR*)0xF8859200u)

/** \brief  FE04, Program Status Word */
#define CPU2_PSW /*lint --e(923)*/ (*(volatile Ifx_CPU_PSW*)0xF885FE04u)

/** \brief  1030, SRI Error Generation Register */
#define CPU2_SEGEN /*lint --e(923)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8851030u)

/** \brief  900C, SIST Mode Access Control Register */
#define CPU2_SMACON /*lint --e(923)*/ (*(volatile Ifx_CPU_SMACON*)0xF885900Cu)

/** \brief  FD10, Software Debug Event */
#define CPU2_SWEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_SWEVT*)0xF885FD10u)

/** \brief  FE14, System Configuration Register */
#define CPU2_SYSCON /*lint --e(923)*/ (*(volatile Ifx_CPU_SYSCON*)0xF885FE14u)

/** \brief  8004, CPU Task Address Space Identifier Register */
#define CPU2_TASK_ASI /*lint --e(923)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8858004u)

/** \brief  E400, CPU Temporal Protection System Control Register */
#define CPU2_TPS_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF885E400u)

/** \brief  E404, CPU Temporal Protection System Timer Register */
#define CPU2_TPS_TIMER0 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E404u)

/** \brief  E408, CPU Temporal Protection System Timer Register */
#define CPU2_TPS_TIMER1 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E408u)

/** \brief  E40C, CPU Temporal Protection System Timer Register */
#define CPU2_TPS_TIMER2 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF885E40Cu)

/** \brief  F004, Trigger Address */
#define CPU2_TR0_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F004u)

/** Alias (User Manual Name) for CPU2_TR0_ADR.
* To use register names with standard convension, please use CPU2_TR0_ADR.
*/
#define	CPU2_TR0ADR	(CPU2_TR0_ADR)

/** \brief  F000, Trigger Event */
#define CPU2_TR0_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F000u)

/** Alias (User Manual Name) for CPU2_TR0_EVT.
* To use register names with standard convension, please use CPU2_TR0_EVT.
*/
#define	CPU2_TR0EVT	(CPU2_TR0_EVT)

/** \brief  F00C, Trigger Address */
#define CPU2_TR1_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F00Cu)

/** Alias (User Manual Name) for CPU2_TR1_ADR.
* To use register names with standard convension, please use CPU2_TR1_ADR.
*/
#define	CPU2_TR1ADR	(CPU2_TR1_ADR)

/** \brief  F008, Trigger Event */
#define CPU2_TR1_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F008u)

/** Alias (User Manual Name) for CPU2_TR1_EVT.
* To use register names with standard convension, please use CPU2_TR1_EVT.
*/
#define	CPU2_TR1EVT	(CPU2_TR1_EVT)

/** \brief  F014, Trigger Address */
#define CPU2_TR2_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F014u)

/** Alias (User Manual Name) for CPU2_TR2_ADR.
* To use register names with standard convension, please use CPU2_TR2_ADR.
*/
#define	CPU2_TR2ADR	(CPU2_TR2_ADR)

/** \brief  F010, Trigger Event */
#define CPU2_TR2_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F010u)

/** Alias (User Manual Name) for CPU2_TR2_EVT.
* To use register names with standard convension, please use CPU2_TR2_EVT.
*/
#define	CPU2_TR2EVT	(CPU2_TR2_EVT)

/** \brief  F01C, Trigger Address */
#define CPU2_TR3_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F01Cu)

/** Alias (User Manual Name) for CPU2_TR3_ADR.
* To use register names with standard convension, please use CPU2_TR3_ADR.
*/
#define	CPU2_TR3ADR	(CPU2_TR3_ADR)

/** \brief  F018, Trigger Event */
#define CPU2_TR3_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F018u)

/** Alias (User Manual Name) for CPU2_TR3_EVT.
* To use register names with standard convension, please use CPU2_TR3_EVT.
*/
#define	CPU2_TR3EVT	(CPU2_TR3_EVT)

/** \brief  F024, Trigger Address */
#define CPU2_TR4_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F024u)

/** Alias (User Manual Name) for CPU2_TR4_ADR.
* To use register names with standard convension, please use CPU2_TR4_ADR.
*/
#define	CPU2_TR4ADR	(CPU2_TR4_ADR)

/** \brief  F020, Trigger Event */
#define CPU2_TR4_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F020u)

/** Alias (User Manual Name) for CPU2_TR4_EVT.
* To use register names with standard convension, please use CPU2_TR4_EVT.
*/
#define	CPU2_TR4EVT	(CPU2_TR4_EVT)

/** \brief  F02C, Trigger Address */
#define CPU2_TR5_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F02Cu)

/** Alias (User Manual Name) for CPU2_TR5_ADR.
* To use register names with standard convension, please use CPU2_TR5_ADR.
*/
#define	CPU2_TR5ADR	(CPU2_TR5_ADR)

/** \brief  F028, Trigger Event */
#define CPU2_TR5_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F028u)

/** Alias (User Manual Name) for CPU2_TR5_EVT.
* To use register names with standard convension, please use CPU2_TR5_EVT.
*/
#define	CPU2_TR5EVT	(CPU2_TR5_EVT)

/** \brief  F034, Trigger Address */
#define CPU2_TR6_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F034u)

/** Alias (User Manual Name) for CPU2_TR6_ADR.
* To use register names with standard convension, please use CPU2_TR6_ADR.
*/
#define	CPU2_TR6ADR	(CPU2_TR6_ADR)

/** \brief  F030, Trigger Event */
#define CPU2_TR6_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F030u)

/** Alias (User Manual Name) for CPU2_TR6_EVT.
* To use register names with standard convension, please use CPU2_TR6_EVT.
*/
#define	CPU2_TR6EVT	(CPU2_TR6_EVT)

/** \brief  F03C, Trigger Address */
#define CPU2_TR7_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF885F03Cu)

/** Alias (User Manual Name) for CPU2_TR7_ADR.
* To use register names with standard convension, please use CPU2_TR7_ADR.
*/
#define	CPU2_TR7ADR	(CPU2_TR7_ADR)

/** \brief  F038, Trigger Event */
#define CPU2_TR7_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF885F038u)

/** Alias (User Manual Name) for CPU2_TR7_EVT.
* To use register names with standard convension, please use CPU2_TR7_EVT.
*/
#define	CPU2_TR7EVT	(CPU2_TR7_EVT)

/** \brief  FD30, CPU Trigger Address x */
#define CPU2_TRIG_ACC /*lint --e(923)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF885FD30u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu
 * \{  */

