luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_reg.h
/** \brief  E054, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E054u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN5_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN5_UA.
*/
#define	CPU1_SPROT_RGNUA5	(CPU1_SPROT_RGN5_UA)

/** \brief  E068, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN6_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E068u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA6	(CPU1_SPROT_RGN6_ACCENA)

/** \brief  E06C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN6_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E06Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB6	(CPU1_SPROT_RGN6_ACCENB)

/** \brief  E060, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E060u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_LA.
*/
#define	CPU1_SPROT_RGNLA6	(CPU1_SPROT_RGN6_LA)

/** \brief  E064, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E064u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_UA.
*/
#define	CPU1_SPROT_RGNUA6	(CPU1_SPROT_RGN6_UA)

/** \brief  E078, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN7_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E078u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA7	(CPU1_SPROT_RGN7_ACCENA)

/** \brief  E07C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN7_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E07Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB7	(CPU1_SPROT_RGN7_ACCENB)

/** \brief  E070, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E070u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_LA.
*/
#define	CPU1_SPROT_RGNLA7	(CPU1_SPROT_RGN7_LA)

/** \brief  E074, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E074u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_UA.
*/
#define	CPU1_SPROT_RGNUA7	(CPU1_SPROT_RGN7_UA)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu2_sprot
 * \{  */

/** \brief  E100, CPU Safety Protection Register Access Enable Register A */
#define CPU2_SPROT_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_ACCENA*)0xF884E100u)

/** \brief  E104, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_ACCENB*)0xF884E104u)

/** \brief  E008, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN0_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E008u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN0_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN0_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA0	(CPU2_SPROT_RGN0_ACCENA)

/** \brief  E00C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN0_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E00Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN0_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN0_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB0	(CPU2_SPROT_RGN0_ACCENB)

/** \brief  E000, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E000u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN0_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN0_LA.
*/
#define	CPU2_SPROT_RGNLA0	(CPU2_SPROT_RGN0_LA)

/** \brief  E004, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E004u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN0_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN0_UA.
*/
#define	CPU2_SPROT_RGNUA0	(CPU2_SPROT_RGN0_UA)

/** \brief  E018, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN1_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E018u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN1_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA1	(CPU2_SPROT_RGN1_ACCENA)

/** \brief  E01C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN1_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E01Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN1_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB1	(CPU2_SPROT_RGN1_ACCENB)

/** \brief  E010, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E010u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN1_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_LA.
*/
#define	CPU2_SPROT_RGNLA1	(CPU2_SPROT_RGN1_LA)

/** \brief  E014, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E014u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN1_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN1_UA.
*/
#define	CPU2_SPROT_RGNUA1	(CPU2_SPROT_RGN1_UA)

/** \brief  E028, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN2_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E028u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA2	(CPU2_SPROT_RGN2_ACCENA)

/** \brief  E02C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN2_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E02Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB2	(CPU2_SPROT_RGN2_ACCENB)

