luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCpu_reg.h
/** \brief  E020, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E020u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_LA.
*/
#define	CPU2_SPROT_RGNLA2	(CPU2_SPROT_RGN2_LA)

/** \brief  E024, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E024u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN2_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN2_UA.
*/
#define	CPU2_SPROT_RGNUA2	(CPU2_SPROT_RGN2_UA)

/** \brief  E038, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E038u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA3	(CPU2_SPROT_RGN3_ACCENA)

/** \brief  E03C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E03Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB3	(CPU2_SPROT_RGN3_ACCENB)

/** \brief  E030, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E030u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_LA.
*/
#define	CPU2_SPROT_RGNLA3	(CPU2_SPROT_RGN3_LA)

/** \brief  E034, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E034u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN3_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN3_UA.
*/
#define	CPU2_SPROT_RGNUA3	(CPU2_SPROT_RGN3_UA)

/** \brief  E048, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN4_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E048u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA4	(CPU2_SPROT_RGN4_ACCENA)

/** \brief  E04C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN4_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E04Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB4	(CPU2_SPROT_RGN4_ACCENB)

/** \brief  E040, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E040u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_LA.
*/
#define	CPU2_SPROT_RGNLA4	(CPU2_SPROT_RGN4_LA)

/** \brief  E044, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E044u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN4_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN4_UA.
*/
#define	CPU2_SPROT_RGNUA4	(CPU2_SPROT_RGN4_UA)

/** \brief  E058, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN5_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E058u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN5_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN5_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA5	(CPU2_SPROT_RGN5_ACCENA)

/** \brief  E05C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN5_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E05Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN5_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN5_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB5	(CPU2_SPROT_RGN5_ACCENB)

/** \brief  E050, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E050u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN5_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN5_LA.
*/
#define	CPU2_SPROT_RGNLA5	(CPU2_SPROT_RGN5_LA)

/** \brief  E054, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E054u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN5_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN5_UA.
*/
#define	CPU2_SPROT_RGNUA5	(CPU2_SPROT_RGN5_UA)

/** \brief  E068, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN6_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E068u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN6_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN6_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA6	(CPU2_SPROT_RGN6_ACCENA)

/** \brief  E06C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN6_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E06Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN6_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN6_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB6	(CPU2_SPROT_RGN6_ACCENB)

/** \brief  E060, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E060u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN6_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN6_LA.
*/
#define	CPU2_SPROT_RGNLA6	(CPU2_SPROT_RGN6_LA)

/** \brief  E064, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E064u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN6_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN6_UA.
*/
#define	CPU2_SPROT_RGNUA6	(CPU2_SPROT_RGN6_UA)

/** \brief  E078, CPU Safety Protection Region Access Enable Register A */
#define CPU2_SPROT_RGN7_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF884E078u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN7_ACCENA.
* To use register names with standard convension, please use CPU2_SPROT_RGN7_ACCENA.
*/
#define	CPU2_SPROT_RGNACCENA7	(CPU2_SPROT_RGN7_ACCENA)

/** \brief  E07C, CPU Safety Protection Region Access Enable Register B */
#define CPU2_SPROT_RGN7_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF884E07Cu)

/** Alias (User Manual Name) for CPU2_SPROT_RGN7_ACCENB.
* To use register names with standard convension, please use CPU2_SPROT_RGN7_ACCENB.
*/
#define	CPU2_SPROT_RGNACCENB7	(CPU2_SPROT_RGN7_ACCENB)

/** \brief  E070, CPU Safety Protection Region Lower Address Register */
#define CPU2_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF884E070u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN7_LA.
* To use register names with standard convension, please use CPU2_SPROT_RGN7_LA.
*/
#define	CPU2_SPROT_RGNLA7	(CPU2_SPROT_RGN7_LA)

/** \brief  E074, CPU Safety protection Region Upper Address Register */
#define CPU2_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF884E074u)

/** Alias (User Manual Name) for CPU2_SPROT_RGN7_UA.
* To use register names with standard convension, please use CPU2_SPROT_RGN7_UA.
*/
#define	CPU2_SPROT_RGNUA7	(CPU2_SPROT_RGN7_UA)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCPU_REG_H */
